[Fortress X2AbilityTemplate]
LocLongDescription="The <Ability:ClassName/> is immune to fire, frost, poison, acid, and explosive damage."
LocHelpText="The <Ability:ClassName/> is immune to fire, frost, poison, acid, and explosive damage."
LocPromotionPopupText="<Bullet/> A <Ability:ClassName/> with the Fortress ability can walk through fire, frost, poison, and acid with no ill effects.<br/>"